In [23]:
import pandas as pd

In [24]:
dados = pd.read_csv('Dados/aluguel_residencial_07.csv',sep=';',index_col=0)

In [25]:
dados_aux = dados[['ValorBruto', 'Valor_m2', 'ValorTotal_m2', 'Tipo_Agregado']]

dados_aux.head()

   ValorBruto  Valor_m2  ValorTotal_m2 Tipo_Agregado
0      2260.0     42.50          56.50   Apartamento
1      7000.0     70.00          70.00          Casa
2      1210.0     53.33          80.67   Apartamento
3      1030.0     16.67          21.46   Apartamento
5      1618.0     26.00          32.36   Apartamento

In [26]:
del dados_aux['ValorBruto']

In [27]:
dados_aux.head()

   Valor_m2  ValorTotal_m2 Tipo_Agregado
0     42.50          56.50   Apartamento
1     70.00          70.00          Casa
2     53.33          80.67   Apartamento
3     16.67          21.46   Apartamento
5     26.00          32.36   Apartamento

In [28]:
dados_aux.pop('ValorTotal_m2')

0        56.50
1        70.00
2        80.67
3        21.46
5        32.36
         ...
22575    20.54
22576    43.52
22577    33.85
22578    40.54
22579    53.71
Name: ValorTotal_m2, Length: 21826, dtype: float64

In [29]:
dados_aux.head()

   Valor_m2 Tipo_Agregado
0     42.50   Apartamento
1     70.00          Casa
2     53.33   Apartamento
3     16.67   Apartamento
5     26.00   Apartamento

In [33]:
dados.drop(['ValorBruto','ValorTotal_m2'], axis = 1, inplace = True)
dados.head(3)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor_m2,Tipo_Agregado
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,42.50,Apartamento
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,70.00,Casa
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento

In [35]:
dados.to_csv('Dados/aluguel_residencial_08.csv',sep=';', index = False)